app/controllers/images_controller.rb

SELECT  "images".* FROM "images" WHERE "images"."id" = ? LIMIT 1  [["id", 1]]
---
	def show
		@image = Image.find(params[:id])

SELECT  "images".* FROM "images" WHERE "images"."id" = ? LIMIT 1  [["id", 0]]
---
	def edit
		@image = Image.find(params[:id])

INSERT INTO "images" ("title", "date", "dims", "medium", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "yoshi"], ["date", "2009"], ["dims", "12x8"], ["medium", "tubesock"], ["created_at", "2015-01-14 02:16:12.540641"], ["updated_at", "2015-01-14 02:16:12.540641"]]
---
	def create
		@image = Image.new(image_params)

		@image.save

SELECT  "images".* FROM "images" WHERE "images"."id" = ? LIMIT 1  [["id", 6]]
UPDATE "images" SET "medium" = ?, "updated_at" = ? WHERE "images"."id" = ?  [["medium", "tubesock and sweater on pillow"], ["updated_at", "2015-01-19 15:45:50.807027"], ["id", 6]]
---
	def update
		@image = Image.find(params[:id])

		if @image.update(image_params)

SELECT  "images".* FROM "images" WHERE "images"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "images" WHERE "images"."id" = ?  [["id", 1]]
---
	def destroy
		@image = Image.find(params[:id])
		@image.destroy